# coding:utf8
"""
--------------------------------------------------------------------------
    File:   b.py
    Auth:   zsdostar
    Date:   2018/2/22 20:37
    Sys:    Windows 10
--------------------------------------------------------------------------
    Desc:   
--------------------------------------------------------------------------
"""

COM = [u'腾讯',u'阿里巴巴',u'百度',u'京东',u'网易',u'新浪',u'搜狐',u'美团',u'携程',u'360',u'小米',u'苏宁控股',u'鹏博士',u'网宿科技',u'用友',u'东方明珠新媒体',u'新华网',u'三七互娱',u'饿了么',u'东软集团',u'二三四五',u'凤凰网',u'钢银电商',u'顺网科技',u'多益网络',u'同程集团',u'宜人贷',u'昆仑万维',u'途牛旅游网',u'游族网络',u'联动优势',u'边锋网络',u'汽车之家',u'房天下',u'找钢网',u'东方财富',u'4399',u'乐居',u'美图',u'竞技世界',u'今日头条',u'迅雷网络',u'东方网',u'连尚网络',u'咪咕公司',u'中钢网',u'网龙',u'蜗牛数字',u'龙采',u'朗玛信息',u'吉比特',u'泰一指尚',u'央视网',u'人民网',u'梦网科技',u'快乐阳光',u'波克城市',u'拓维信息',u'二六三',u'世纪互联',u'微贷网',u'六间房',u'米哈游',u'暴风集团',u'光环新网',u'易建科技',u'开创集团',u'世纪佳缘',u'猪八戒网',u'有米科技',u'塑米信息',u'斗鱼直播',u'科大讯飞',u'蘑菇街',u'思贝克',u'利嘉电商',u'晨之科',u'锐之旗',u'运满满',u'竞网',u'中至集团',u'信产',u'酷狗音乐',u'游爱网络',u'盛天网络',u'首都信息',u'沪江',u'心动网络',u'中通',u'申通',u'圆通',u'韵达',u'运营商',u'谷歌',u'微软',u'诺基亚',u'亚马逊',u'万达',u'知乎',u'Facebook',u'脸书',u'网易',u'GitHub',u'雅虎',u'eBay',u'推特',u'苹果',u'软银',u'滴滴',u'华为',u'思科',u'银行',u'中兴',u'爱奇艺',u'智行',u'金山',u'中国移动',u'中国联通',u'中国电信',u'大疆']
